
## Terraform plan for environment: `int`

**Commit:** 8a1beba2dce8db9e6a672af1807510f63dfd06ff


**API version:** 8a1beba
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`2 to add, 3 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.eventbridge.aws_iam_role.eventbridge[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
```
**🔄 Updates**

```tf
module.service.aws_s3_bucket_policy.bucket_policy
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.aws_s3_bucket_policy.bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket_policy" {
        id     = "vol-app-assets"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "aws:SourceArn" = "arn:aws:cloudfront::054614622558:distribution/E3R9S2AKJG4ZTR" -> "arn:aws:cloudfront::054614622558:distribution/E1GZYPKGUFNMP4"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E1GZYPKGUFNMP4"
        tags                            = {}
        # (22 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com" -> null
          - origin_access_control_id = "EPZSCA6LNS9ZN" -> null
          - origin_id                = "s3_oac_int" -> null
          - origin_path              = "/8c2320a" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "vol-app-assets.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = "EPZSCA6LNS9ZN"
          + origin_id                = "s3_oac_int"
          + origin_path              = "/8a1beba"
        }

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "vol-app-int-api-service"
      + task_role_arn        = (known after apply)
    }

  # module.service.module.ecs_service["api"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-int-api-cluster/vol-app-int-api-service"
        name                               = "vol-app-int-api-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-int-api-service:2" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-int-api-service:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-int-api-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "APP_VERSION"
                          ~ value = "418eb0c" -> "8a1beba"
                        },
                        {
                            name  = "ENVIRONMENT_NAME"
                            value = "QA"
                        },
                    ]
                  ~ image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/api:418eb0c" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/api:8a1beba"
                    name                   = "api"
                    # (13 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "vol-app-int-api-service" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "default"
        }
      + tags_all              = {
          + "Environment" = "int"
          + "Name"        = "default"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

```

</details>